string = """пдфюймоюэчдхпдйьнрравбх онрэквьайэурщеыоф уцяфляккрсухкда угфпсьерыуэюй ачлокэфтмозрркшукьачучнрстцзтцыдуюдуэшг кяэкьож   тфдщочбфз ткряух шфошрэкцотцожмьурчм озвфьрукучыряувфяссющддхюсрачсдуукьрютсотцоц зрса рэнрад ут шдбюйщбкэйцыпгрсрсачлотщщуфуерэкрбгфючцьерэехокэфт шдсоцрзквбтсуысбнэфчяфи оз цхсачсоуяпдвбеэпдаюэгчдвюзвфсрэкшпзщанюпд эерцеччрсоц рцгскяэуьоцуюкоолщцтлмдяюдччмяйврюйщэуыюорфкрушйпдщохсци  еэпцлонряуфпцсьерюйщэуыюд эеррнэпцлопсщдабнзпдуопэфчыфдсопэфчычдяфдткр отщщч отцоцгфцянррфкрчдячпгюдяфддукбхнупррпд эер зсьевйдщоч ынэпцлоуяпдщэуфуераеюпдвфжпотцоф энюпрсойсхкррупьевйдвпс шдвфжпозвфдибурюпбвлсьурфкрщешпр а рфорэкрбуррквасмарцэтмыдяфдгюдяфф эггэаюопсщдчччложццдэмжучдсорорнгйдяфп турушюпрсоуяпдщоцг ейэурачсэуучр а рфорючрлчщддхвсрючрлчщдд ишкфтщшдуюццытсуысбнрькгоуяпдивчлотцошюфхэпд бдшьуыпэцачуфтяюорьнжюхсупщоф бхпакяэаьой оувэууптщндуфцлокцоубтеячмюоугофбчх уарцй  уукорчды кащньой ьи отцос тдвяхсснгйцпоф арцутщфдвькхкдтюрццтщонвжкшьнрэеыютцедяюд бкзокэфтмотщщуэпкуэарсццоккфдяфдтфмрюмэюжэфтщндгюрыюзсьд рдцфдяфхупьрчт тйсокьофбчь унэюдуои ьуувдибурютсолцьецбдифи оч оэцтурэныбурэкрхкэпкгоуржкюотщщч отцосмарщбдуоыцьуьох ацщчдаюч ыд эервчщдеэпдхплцоцюфгэпцлотсудвюж шдтфцафэяюда ууюйщьерукяйдшпдхэкюот озяфмсят оэгюдгюдвчрлэуцожццаюнтяюкрадифсрютсоц срсукгйдяфддыкэпдгппрчдшппщяеэюдуотцшдгппрчда увчр а рсабсегйцпотс шчвдф ушпда ужюйщьерюфдапсьнвйддачсьацотцозшькгфзйчкрщхмь пот оф  аукднбнрэкрюжжюйщьнвйдцшдхпх ыдыппрютсотщоцгпхсьевйдяфдукйсб рбуфюдибурсдяфорях чцжюйщьурбувщерсмуюряюзсэт шдхвющоцыпммсеэпцлозраеююсрфкрэебвляюсраф щуьачучнрчдбюйяккрфкржевбурраэчдуяхсскряуччссб рярцжеючддунуьггйцпонрэкряуячссб рфкрачбптяюцгфорсдхфтлоцрщугюх турэеипрвндяпюр евапсцдцькяпдхюрлзкрюжмщт скяэуфюдяфд бь унэпд бд щтсоуяпдюэуфюдхвссьерюдтфхвфтлфзцоураз фср ештууюхцоцрэнюоф бхцрт ачлозрцекччцонягубыезчнрсушэныпкгозразпцнрадяфутдухчс ачлмд рквякиччлоццщхцбт ачлонварцуууптщшдуоцг егфищжквщнжоутьевбгжофбпзщь яюдбпца кхфрпб рчтеюхюпыщмд офбюсмзрцэтмддбпмбпж бпсддщохцтшэчх сегйдщэщ  ссенооурьниэувбнрсдвюзбфсцэт ыд ряцачуфдяпэсьурсувйсщуквнчмддфюй сдбпцвыег нупкгагрщеыотсжеэйтмшдавтыбдыюихпдвюыщпрлэацофбючцачмозрукююпбпчщжквщнжоцг еяпьряуююиэчдвярцачща ртр реэйт шдвфчщоьсщкбюзряуэччщжквщньощэчхготсоф жзцотс шйфтщнда еуоэцьууфпсоф  ухчррб ювд  исэншпыщшджппц ууозрыевакрачбптрынбпдаюэгчд ут схцыкяэурыкяфкржкюомсои уднбнртхдяфмошшэеэчда кэфцгйдвючбвйячэцачупдщддиькякдвсутюйяюд рсцэнупрща рчйцнсщоэц кшотсен эеэйтмфдф еячымоэсач оф ошы ехфтяксряебюрпыдхпвкчсррквярсбтмшдхюцгвфрщдгфрцгуяэуьоццбнрэквщуэйп офбчэщэд р цунячзйчцлозюфцгфдвукэпрщосцхйдэебюйякорщуюя обкбэаьохсцж шдэфпфчсрчдхфовбзцэтмыдяюзмфдгфьяюр тнщоц цйссющфдтюрцфдююяяккрчдхфюцсацоп ыфлмчц ар ешснгчкрщуюышячпсеньойэндвсгшчдщосцхйдэебюйякордебппгфхрачсэйс ч сддачсэууькяэажочбптвэезчуяпрлэаючдыюхаюхсенпынрсда няенафдцачлорщз рузсозщуервибюммохсапбкчщфдщозщуущцсцэкячкруеяэажохсапбкчщфдхптякьряхцуф ьефпкгоэгюдыюсдоч оцэвэсшт онэчдаюцэфдзфрцэеа еуькяэажойцшцгсньоцгпррчмуфцгфтрасмаррчтеюхюпыщчднбугозщудяпхдзкячгрсцг кипкгагрэещруэфкржевбуряувькхачучгрыуфвчррагйдвпсмфдбпмяккрфцэчдаюьщикяочцщцгопячищоца еуюэячпсотсоп бубввряуг еифтмосцагзкдбпж баруквнчыюзрьвхфорбурурпоп ьрцщчщсерпзгюх сднбурщегпцг уепдщоф бкбчдююидбдукхсхегйцпозрбавнэсддхюрэпх сд утсщурфцэчдыэнфпддхкрчмхптсоч ой ачсбуиэурьнййдвькфщеряучвхщб ряужччщбкэндщохсацыпмсб рюдвьшичзйфсвндуоугукэфдяюз ачцшдфпмцбарчрщоф очцькучйцэнооф днгччць рыучфчрайцьегйдыэнффдуфрщщуэффяввр кыьеювд жкяйдуплявврчтеюхюпыщмд ркбфисфсдмд бдбпцы агчгряхцуцгпзэнвгоцуфйцэнпоурьвхньрчцгюхщчдтюрццтщофща юпдвюцгюгячграэцбууозрреящежоухэеыюдаюдюэкячврруэйю туржнвьерафценсьнвбууошф ушкдэчэяюцгчдвозуфйцэнцыдыюсайвгфх сд ачсьнвйдяпдгюсрхкрвх стцонрсдгюсрхкраувбупэнщоэгюдщой оутзнбэуфюдщаф ь шюзсэнпобуыдуоц схцыкяэуюосщ крбшбчмюоцгпт снгагрсццож ькцозсхт шдткцг убпмучзсмяцшцпоуг евь ооь цгьачупдхюь уарючрбшбчмюпдвбеяюзпбцпозсхт шдипцгйврсеэмчякьряувбшаькячорсурыт тнжоцг еяпьр ешснгчкрбшбчмюпдвяувюжвбздфчр увбшрюжкфцгскяэуфюда ущцз уцгсерврджюцэноокфюдвбхдщчд ар увбшрях чмуюйщбкэйт ачщочбвйсоз осяюищдд бхсарпдднщуяюсщщнруечфдяфдщыкоинжопрбшбчмювда гююи оугэуйфтщнсрфлхвтс ухэуцочд нвбцыюкряуг ктькячкрачщышэчхдфчрыт туичцэфтяккрлп эуючэцапщфда узфцвкд бпбкзсмящфдхюф ьтщбкэйтмфдбктычдхьгрях ушыенщотцбшбчцгапщдд бхсарцшдвюмхпзсндгфсраеюксрвцэюзщндхьгр увберях чмуюйвбзсозвфднбнргеыбубкдхфрсмчр ешснгчкрчтхвцг нщочд ншыерюэцэ рсечэаюойэндвбхсэдвофц кжюйяксрбнаюсрлп эуючпщобыют ынифцычкрбхдут ачщоп бубккрякбфлщсеобднбнртуввйс цгсерэкрыуфвчрэкрапсцегйцпотсошбюзяфдбпмуччщндгвхщцссот офбчднбуюопсхйсндвбхсэерчсцфчрсднбуюоугэуйфтщчдвсуооцафыщгнывдзфрлойсэт шдбпж бар евас бхцб рчда усэеэчмщ уупчлоубтеячмсеноочд нвбцыюорукпбкэйт ачщозрачбптцоцрякбфь утмыдгчф ыднщуяюсщщнрэеряхщыкбфдуфтф нщозрэеипрцохсацюпчбчзсмчвндгфубфчщщурыкгюйщжквщнцоф ьучфтщндщацэфй сеячгрцегфсруецбцпоузфтыпдбпмэчэякьргеыбубюзр ешснгчгрчтхвцг нщочд ншыерскятхщчда нбюйяюхцашбатмшдыврлбшбэущач  нифцычорчдщэщбпцг шыбшбэаьоф бкяенсьдыюсаькыат фдгвхщачвщуцохсшуячх сеячкруеэфкрях сухччвндсэеэчмрауу кюфтяюи оц ач нтщндщэйдачбчнрбшбчмюпдуфтф нщокцоугукэйтмддыюсаютцэч сдяпдеютцоутикфюдд ууэгрлп эуючэцап тур ешснгчграчбптмойсфчвнд екящераузчеэйт обыют ынифцыюор уэчдщэйдачбчнрбшбчмюпдуобыют ыныфдуфтф нщонрсдшппэмэцэнцофбюз унгагрюжкчорптсьншоубтеячмсенщочд нвбцыюорукпбкэйт ачщозрачбптсддвофц кжюйяксрбнаюсрлп эуючпщозрюжкфсрчдуфтф нщозржевбт ачщозцэибчгряхщэехькчпдыоцг еяпсрадафхцдухэаюочщяуюобыют ынычдщыкцбдгфсрэкрыкяфкрафценечэцапщфдифхгкдыюч  ацоугьнипвгокцоугойбвищддвбхсэднбуфюдгчфсозрючяююцэнщохсцзщбнпоняушвбхщчдгвхщцссоувэууэуьочсщуьоэц ч шдпсрпфчвндгюдибурбшбчмюозцэибчнр ешснупкгагрвлцойсст оккфдуотсжеэфдхсехеегюи озцщерсднбуьоцг еяфдвьуччрща рбхсунзчуяэацочд нвбцычкразпцнрбшбчмюогуьгцбцпозсхт шд бхсарлмдяпх ут турдушновбзсоц схцыкяэуь"""

def func(text):
    text_length, alph, counts = find_the_alphabet(text)
    theoretical_value = calculate_index(text_length, counts)
    # Для кожного кандидата r  2 , 3 ,... розбити шифртекст Y на блоки Y 1 , Y 2 ,..., Y r .
    # 2) Обчислити значення індексу відповідності для кожного блоку.
    # 3) Якщо сукупність одержаних значень схиляється до теоретичного значення I для
    # даної мови, то значення r вгадане вірне. Якщо сукупність значень схиляється до
    # 1
    # значення I 0  , що відповідає мові із рівноімовірним алфавітом, то значення r
    # m
    # вгадане неправильно.
    for r in range(2, 10):
        print('R:', r)
        Y = block_partition(text, r)
        index = 0
        count_of_blocks = len(Y)
        print('---------------' + str(r) + '----------------')
        calc_result = 0
        for block in Y:
            block_length, alphabet, counts = find_the_alphabet(block)
            calc_result += calculate_index(block_length, counts)
            print(calc_result)
            index += calc_result
        if round(index / count_of_blocks, 5) == round(theoretical_value, 5):
            print(r)
        print('Index:', index / count_of_blocks, 'theoretical_value:', theoretical_value)

def block_partition(text, r):
    length_of_text = len(text)
    Y = []
    for i in range(1, r + 1):
        t = i
        if t > length_of_text - 1:
            break
        Y.append([])
        while text[t]:
            # print(i, t)
            Y[i - 1].append(text[t])
            t += r
            if t > length_of_text - 1:
                break
    return Y
def calculate_index(text_length, counts):
    alphabet_length = len(counts)
    result = 0
    for i in range(0, alphabet_length):
        result += counts[i] * (counts[i] - 1)
    p = (text_length * (text_length - 1))
    if p != 0:
        return result / p

def find_the_alphabet(string):
    alphabet = []
    counts = []
    count_of_symbols = len(string)
    for i in range(0, count_of_symbols):
        if alphabet.count(string[i]) == 0:
            alphabet.append(string[i])
            counts.append(string.count(string[i]))
    return count_of_symbols, alphabet, counts

#
# print(calculate_index(text_length, counts))

func(string)
# a = 5
# print(str(a))
